import './Misc.scss';

const Misc = () => {
    return (
        <section className="misc container">
            <div className="misc__header">
                <h1 className="misc__title">
                    Договор-оферта
                </h1>
                <p className="misc__subtitle">
                    На оказание услуг при приеме платежей (редакция 3.2 от 25 ноября
                    2024 г.)
                </p>
            </div>
            <p className="misc__description">
                       <span className="misc__description-item">
                            Общество с ограниченной ответственностью «Технологии Интеграции»
                       </span> , именуемое в дальнейшем Агрегатор, адресует настоящую Оферту юридическим лицам,
                индивидуальным предпринимателям и физическим лицам, применяющих специальный налоговый режим
                «Налог на профессиональный доход (далее – Получатель), желающим заключить настоящий Договор на
                оказание услуг по приему платежей с использованием платежного сервиса Apiport.pro (далее –
                Договор, Оферта).
                Договор считается заключенным и приобретает силу с момента совершения Получателем действий,
                предусмотренных Офертой и означающих безоговорочное принятие Получателем всех условий Оферты без
                каких-либо изъятий или ограничений на условиях, изложенных ниже.
            </p>
            <div className="misc__body">
                <h2 className="visually-hidden">Our offer</h2>
                <div className="misc__item">
                    <h3 className="misc__item-title">1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h3>
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.1. Акцепт Оферты
                                </span>
                        – совершение Получателем действий, свидетельствующих о принятии условий настоящего
                        Договора в полном объеме.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.2. Запрещенные товары
                                </span>
                        – виды Товаров, реализуемые Получателем, нарушающие требования законодательства
                        Российской Федерации, требования, установленные Приложениями к Договору, в том числе
                        Товары, которые, не были предоставлены Покупателям после их Оплаты, Товары, в отношении
                        которых Получатель предоставил недостоверную информацию.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.3. Сервис «Apiport.pro» (далее – «Сервис»)
                                </span>
                        – совокупность программных и аппаратных средств, обеспечивающих информационное и
                        технологическое взаимодействие между участниками расчетов при совершении Платежей, а
                        также предоставляющий Получателю возможность использовать иные услуги и сервисы,
                        предоставляемые Агрегатором в порядке и на условиях, установленных Договором.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.4. Интернет-магазин
                                </span>
                        – информационный ресурс Получателя, размещенный в сети «Интернет», имеющий уникальный веб-адрес,
                        предоставляющий Покупателям информацию о Товаре, его стоимости и характеристиках, обеспечивающий
                        возможность сформировать и принять заказ на Товар, выбрать способ оплаты и доставки Товара.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.5. Личный кабинет
                                </span>
                        – раздел сайта https://apiport.pro, расположенного в сети «Интернет» и принадлежащего
                        Агрегатору, позволяющий Агрегатору и Получателю взаимодействовать друг с другом, в том числе
                        представлять документы, регулировать объем и порядок предоставления услуг. 1.6. Недействительная
                        операция (chargeback)
                        Платеж, осуществленный в сети «Интернет» и признанный недействительным по следующим основаниям:
                    </p>
                    <ul className="misc__list">
                        <li className="misc__list-item">
                            Платеж совершен в оплату Запрещенного товара;
                        </li>
                        <li className="misc__list-item">
                            Платеж, по которому установлено совершение противоправных действий;
                        </li>
                        <li className="misc__list-item">
                            Покупатель оплатил Товар другим способом;
                        </li>
                        <li className="misc__list-item">
                             нарушение требований, установленных Договором и Приложениями к Договору;
                        </li>
                        <li className="misc__list-item">
                            по иным основаниям, предусмотренным законодательством РФ.
                        </li>

                    </ul>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.7. Платеж
                                </span>
                        – действия Покупателя, направленные на оплату Товара, реализуемого Получателем.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.8. Агрегатор
                                </span>
                        – Общество с ограниченной ответственностью «Технологии Интеграции», оказывающее Получателю
                        услуги в рамках настоящего Договора.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.9. Операция возврата
                                </span>
                        – операция, направленная на возврат суммы Платежа/части суммы Платежа Покупателю в связи с
                        отменой (возвратом) Покупателем Товара, или в связи с не предоставлением Получателем Товара
                        Покупателю.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.10. Покупатель
                                </span>
                        – лицо, обладающее надлежащей дееспособностью, и совершающее действия, направленные на
                        осуществления Платежей.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                   1.11. Получатель
                                </span>
                        – юридическое лицо, орган государственной власти, орган местного самоуправления, индивидуальный
                        предприниматель, физическое лицо, применяющее специальный налоговый режим «Налог на
                        профессиональный доход», которому Агрегатор оказывает услуги на основании настоящего Договора и
                        в пользу которого осуществляются Платежи Покупателей.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                    1.12. Сообщение о Платеже
                                </span>
                        – данные о принятом Платеже, передаваемые по электронным каналам связи в режиме online и
                        включающие сумму и обязательные реквизиты, позволяющие точно идентифицировать Платеж в системе
                        учета Получателя.
                    </p>
                </div>
                <div className="misc__item">
                    <p className="misc__item-text">
                                <span className="misc__item-text-title">
                                   1.13. Товар
                                </span>
                        – товары, работы, услуги, результаты интеллектуальной деятельности, а также иные виды объектов
                        гражданских прав, не запрещенные и не ограниченные в обороте на территории Российской Федерации,
                        реализуемые Получателем.
                    </p>
                </div>
            </div>
        </section>
    )
}

export default Misc;